app/views/articles/add_country.html.erb

SELECT "countries".* FROM "countries"
---
        <tr>
            <td><%= country.countryname %></td>