app/views/articles/country_list.html.erb

SELECT "countries".* FROM "countries"
---
        <tr>
            <td><%= country.countryname %></td>