app/views/articles/new.html.erb

SELECT "countries".* FROM "countries"
---
    <% @country_list.each do |country| %>
        <%= radio_button_tag(:country, country.countryname) %>