app/controllers/articles_controller.rb

SELECT "countries".* FROM "countries"
SELECT "resources".* FROM "resources"
SELECT "categories".* FROM "categories"
---
    def new
        @country_list = Country.all
        @resource_list = Resource.all
        @category_list = Category.all

SELECT "categories".* FROM "categories"
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-21 16:21:48.398010"], ["text", "test 1"], ["title", "test"], ["updated_at", "2014-07-21 16:21:48.398010"]]
---
    def create
      save_params = Hash.new
      country = params[:country]
      resourcename = params[:resourcename]
      text = country + '-' + resourcename

      save_params['title'] = text

      @category = Category.all
      categoryList = Array.new
      @category.each do |category|
        categoryList.push(category.categoryname)
      end
      new_category = []

      for a_cat in categoryList
        if params.has_value?(a_cat)
            new_category.push(a_cat)
        end
      end

      save_params['text'] = new_category.join('|')

      puts save_params
      @article = Article.new(save_params)

      puts "Article params"
      puts @article

      @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
SELECT "countries".* FROM "countries"
SELECT "resources".* FROM "resources"
SELECT "categories".* FROM "categories"
---
    def edit
        @article = Article.find(params[:id])

       @my_val = @article.text.split('|')
       @my_val2 = @article.title.split('-')
       @my_val.concat(@my_val2)

       @country = Country.all
       @country_hash = Hash.new

       @country.each do |country|
        cname = country.countryname
        @country_hash[cname] = @my_val.include?cname
       end


       @resource  = Resource.all
       @resource_hash = Hash.new

       @resource.each do |resource|
        rname = resource.resourcename
        @resource_hash[rname] = @my_val.include?rname
       end

       @category = Category.all

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
SELECT "categories".* FROM "categories"
UPDATE "articles" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["text", "05:01-17:00"], ["title", "USAAvail"], ["updated_at", "2014-07-26 19:55:51.488982"]]
---
    def update
      @article = Article.find(params[:id])

      save_params = Hash.new
      country = params[:country]
      resourcename = params[:resourcename]
      text = country + '-' + resourcename

      save_params['title'] = text

      @category = Category.all
      category_list = Array.new
      @category.each do |category|
        category_list.push(category.categoryname)
      end
      new_category = []

      for a_cat in category_list
        if params.has_key?(a_cat)
            new_category.push(a_cat)
        end
      end

      save_params['text'] = new_category.join('|')

      if @article.update(save_params)

SELECT  "countries".* FROM "countries"  WHERE "countries"."id" = ? LIMIT 1  [["id", 9]]
DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 9]]
---
    def delete_country
        @country = Country.find(params[:format])
        @country.destroy

SELECT  "resources".* FROM "resources"  WHERE "resources"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 1]]
---
    def delete_resource
        @resource = Resource.find(params[:format])
        @resource.destroy

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 10]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 10]]
---
    def delete_category
        @category = Category.find(params[:format])
        @category.destroy

INSERT INTO "countries" ("countryname", "created_at", "updated_at") VALUES (?, ?, ?)  [["countryname", "Chennai"], ["created_at", "2014-08-18 18:19:53.342986"], ["updated_at", "2014-08-18 18:19:53.342986"]]
SELECT "countries".* FROM "countries"
---
    def add_country
        #Add a country
        country_hash = Hash.new
        input_hash = params['articles']
        country_hash['countryname'] = input_hash['title']
        @country = Country.new(country_hash)
        @country.save
        @country_list = Country.all

SELECT "countries".* FROM "countries"
---
    def country_list
        #Add a country
        @country_list = Country.all

INSERT INTO "resources" ("created_at", "resourcename", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-08-18 20:03:43.528320"], ["resourcename", "Poorni"], ["updated_at", "2014-08-18 20:03:43.528320"]]
---
    def add_resource
        #Add a resource
        resource_hash = Hash.new
        input_hash = params['articles']
        resource_hash['resourcename'] = input_hash['title']
        @resource = Resource.new(resource_hash)
        @resource.save

SELECT "resources".* FROM "resources"
---
    def resource_list
        @resource_list = Resource.all

INSERT INTO "categories" ("categoryname", "created_at", "updated_at") VALUES (?, ?, ?)  [["categoryname", "Poorni"], ["created_at", "2014-08-18 20:03:52.910630"], ["updated_at", "2014-08-18 20:03:52.910630"]]
---
    def add_category
        #Add a category
        category_hash = Hash.new
        input_hash = params['articles']
        category_hash['categoryname'] = input_hash['title']
        @category = Category.new(category_hash)
        @category.save

SELECT "categories".* FROM "categories"
---
    def category_list
        @category_list = Category.all

SELECT  "countries".* FROM "countries"  WHERE "countries"."id" = ? LIMIT 1  [["id", 0]]
---
    def edit_country
        puts params
        @country = Country.find(params[:format])

SELECT  "resources".* FROM "resources"  WHERE "resources"."id" = ? LIMIT 1  [["id", 14]]
---
    def edit_resource
        @resource = Resource.find(params[:format])

SELECT "avail_resources".* FROM "avail_resources"
---
    def show_availresource
        @availresource = AvailResource.all

SELECT "resources".* FROM "resources"
---
    def new_availresource
        @availKeys = ['INDIAExceptionHandler', 'CHINAExceptionHandler', 'USAExceptionHandler', 'UnAvailableResources']
        @resource = Resource.all

SELECT "resources".* FROM "resources"
INSERT INTO "avail_resources" ("created_at", "key", "updated_at", "value") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-19 18:16:06.909867"], ["key", "UnAvailableResources"], ["updated_at", "2014-08-19 18:16:06.909867"], ["value", ""]]
---
    def add_availresource
        params_hash = Hash.new
        params_hash['key'] = params[:title]

        @resource = Resource.all
        selected_resource = []

        @resource.each do |resource|
            if params.has_key?(resource.resourcename)
                selected_resource.push(resource.resourcename)
            end
        end

        params_hash['value'] = selected_resource.join('|')
        puts params_hash
        @availresource = AvailResource.new(params_hash)
        @availresource.save

SELECT  "avail_resources".* FROM "avail_resources"  WHERE "avail_resources"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "avail_resources" WHERE "avail_resources"."id" = ?  [["id", 5]]
---
    def delete_availresource
        @resource = AvailResource.find(params[:format])
        @resource.destroy