app/controllers/articles_controller.rb

    def country_list
        #Add a country
        country_hash = Hash.new
        input_hash = params['articles']
        country_hash['countryname'] = input_hash['title']
        @country = Country.new(country_hash)
        @country.save
---
INSERT INTO "countries" ("countryname", "created_at", "updated_at") VALUES (?, ?, ?)  [["countryname", "test"], ["created_at", "2014-08-17 19:26:49.645591"], ["updated_at", "2014-08-17 19:26:49.645591"]]

    def resource_list
        #Add a resource
        resource_hash = Hash.new
        input_hash = params['articles']
        resource_hash['resourcename'] = input_hash['title']
        @resource = Resource.new(resource_hash)
        @resource.save
---
INSERT INTO "resources" ("created_at", "resourcename", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-08-17 20:09:34.380358"], ["resourcename", "xgao"], ["updated_at", "2014-08-17 20:09:34.380358"]]

    def category_list
        #Add a category
        category_hash = Hash.new
        input_hash = params['articles']
        category_hash['categoryname'] = input_hash['title']
        @category = Category.new(category_hash)
        @category.save
---
INSERT INTO "categories" ("categoryname", "created_at", "updated_at") VALUES (?, ?, ?)  [["categoryname", "hadoop"], ["created_at", "2014-08-17 20:42:43.190228"], ["updated_at", "2014-08-17 20:42:43.190228"]]