app/controllers/articletwos_controller.rb

SELECT "articletwos".* FROM "articletwos"
---
    def index
        @articletwos = Articletwo.all

SELECT  "articletwos".* FROM "articletwos"  WHERE "articletwos"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
        @articletwos = Articletwo.find(params[:id])

INSERT INTO "articletwos" ("created_at", "key", "updated_at", "value") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-16 20:34:36.472550"], ["key", "f"], ["updated_at", "2014-08-16 20:34:36.472550"], ["value", "fd"]]
---
    def create

        params_hash = Hash.new
        articles_hash = params[:articletwos]
        params_hash['key'] = articles_hash[:title]
        params_hash['value'] = articles_hash[:text]

        @articletwo = Articletwo.new(params_hash)
        @articletwo.save

SELECT  "articletwos".* FROM "articletwos"  WHERE "articletwos"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        @articletwo = Articletwo.find(params[:id])

SELECT  "articletwos".* FROM "articletwos"  WHERE "articletwos"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "articletwos" SET "updated_at" = ?, "value" = ? WHERE "articletwos"."id" = 9  [["updated_at", "2014-08-16 21:57:40.260123"], ["value", "fdee"]]
---
    def update
        @articletwo = Articletwo.find(params[:id])

        params_hash = Hash.new
        articles_hash = params[:articletwo]
        params_hash['key'] = articles_hash[:key]
        params_hash['value'] = articles_hash[:value]

        if @articletwo.update(params_hash)

SELECT  "articletwos".* FROM "articletwos"  WHERE "articletwos"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "articletwos" WHERE "articletwos"."id" = ?  [["id", 8]]
---
    def destroy
        @article = Articletwo.find(params[:id])
        @article.destroy